tefilus/MBD_PMSM/exampleSixStep/Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop_ert_rtw/Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop.h
/* Block states (default storage) for system '<Root>' */
typedef struct {
  real_T Sum_DWORK1;                   /* '<S127>/Sum' */
  real32_T Integrator_DSTATE;          /* '<S54>/Integrator' */
  real32_T UnitDelay_DSTATE;           /* '<S108>/Unit Delay' */
  uint32_T Delay_DSTATE[20];           /* '<S105>/Delay' */
  volatile real32_T RT1_Buffer[2];     /* '<Root>/RT1' */
  volatile real32_T RT2_Buffer[2];     /* '<Root>/RT2' */
  real32_T desiredSpeed;               /* '<Root>/g_desiredSpeed' */
  volatile real32_T RT3_Buffer[2];     /* '<Root>/RT3' */
  real32_T idcSCI_B;                   /* '<Root>/g_idcSCI_B' */
  real32_T speedSCI_B;                 /* '<Root>/g_speedSCI_B' */
  int32_T DigitalOutput_FRAC_LEN;      /* '<S7>/Digital Output' */
  int32_T DigitalOutput_FRAC_LEN_g;    /* '<S133>/Digital Output' */
  int32_T Add_DWORK1[3];               /* '<S98>/Add' */
  int32_T DigitalOutput_FRAC_LEN_l;    /* '<S12>/Digital Output' */
  int32_T SpeedCount_DWORK1;           /* '<S105>/SpeedCount' */
  uint16_T Output_DSTATE;              /* '<S90>/Output' */
  volatile int16_T RT1_ActiveBufIdx;   /* '<Root>/RT1' */
  volatile int16_T RT1_semaphoreTaken; /* '<Root>/RT1' */
  volatile int16_T RT2_ActiveBufIdx;   /* '<Root>/RT2' */
  volatile int16_T RT3_ActiveBufIdx;   /* '<Root>/RT3' */
  volatile int16_T RT3_semaphoreTaken; /* '<Root>/RT3' */
  uint16_T IaOffset;                   /* '<Root>/g_IaOffset' */
  uint16_T IbOffset;                   /* '<Root>/g_IbOffset' */
  uint16_T IcOffset;                   /* '<Root>/g_IcOffset' */
  uint16_T Memory_PreviousInput;       /* '<S142>/Memory' */
  uint16_T Memory1_PreviousInput;      /* '<S142>/Memory1' */
  uint16_T Memory2_PreviousInput;      /* '<S142>/Memory2' */
  uint16_T CircBufIdx;                 /* '<S105>/Delay' */
  uint16_T Add_DWORK1_f;               /* '<S97>/Add' */
  int16_T Integrator_PrevResetState;   /* '<S54>/Integrator' */
  boolean_T Enable;                    /* '<Root>/g_Enable' */
  boolean_T readTorqueSign;            /* '<Root>/g_TorqueSign' */
  rtDW_ToLCD_Copy_of_mcb_bldc_six ToLCD;/* '<Root>/ToLCD' */
  rtDW_SpeedControl_Copy_of_mcb_b SpeedControl;/* '<Root>/Speed Control' */
  rtDW_SPIMasterTransfer_Copy_of_ SPIMasterTransfer1;/* '<S133>/SPI Master Transfer' */
  rtDW_SPIMasterTransfer_Copy_of_ SPIMasterTransfer;/* '<S133>/SPI Master Transfer' */
} D_Work_Copy_of_mcb_bldc_sixstep;

/* Invariant block signals (default storage) */
typedef struct {
  const uint16_T Width;                /* '<S14>/Width' */
} ConstBlockIO_Copy_of_mcb_bldc_s;

/* Constant parameters (default storage) */
typedef struct {
  /* Pooled Parameter (Mixed Expressions)
   * Referenced by:
   *   '<S88>/SA1'
   *   '<S89>/SA2'
   */
  boolean_T pooled13[8];

  /* Pooled Parameter (Mixed Expressions)
   * Referenced by:
   *   '<S88>/SA2'
   *   '<S89>/SA1'
   */
  boolean_T pooled14[8];

  /* Pooled Parameter (Mixed Expressions)
   * Referenced by:
   *   '<S88>/SB1'
   *   '<S89>/SB2'
   */
  boolean_T pooled15[8];

  /* Pooled Parameter (Mixed Expressions)
   * Referenced by:
   *   '<S88>/SB2'
   *   '<S89>/SB1'
   */
  boolean_T pooled16[8];

  /* Pooled Parameter (Mixed Expressions)
   * Referenced by:
   *   '<S88>/SC1'
   *   '<S89>/SC2'
   */
  boolean_T pooled17[8];

  /* Pooled Parameter (Mixed Expressions)
   * Referenced by:
   *   '<S88>/SC2'
   *   '<S89>/SC1'
   */
  boolean_T pooled18[8];
} ConstParam_Copy_of_mcb_bldc_six;

/* Real-time Model Data Structure */
struct tag_RTM_Copy_of_mcb_bldc_sixste {
  const char_T * volatile errorStatus;

  /*
   * Timing:
   * The following substructure contains information regarding
   * the timing information for the model.
   */
  struct {
    struct {
      uint16_T TID[3];
    } TaskCounters;
  } Timing;
};

/* Block signals (default storage) */
extern BlockIO_Copy_of_mcb_bldc_sixste Copy_of_mcb_bldc_sixstep_f280_B;

/* Block states (default storage) */
extern D_Work_Copy_of_mcb_bldc_sixstep Copy_of_mcb_bldc_sixstep__DWork;
extern const ConstBlockIO_Copy_of_mcb_bldc_s Copy_of_mcb_bldc_sixstep_ConstB;/* constant block i/o */

/* Constant parameters (default storage) */
extern const ConstParam_Copy_of_mcb_bldc_six Copy_of_mcb_bldc_sixstep_ConstP;

/* External function called from main */
extern void
  Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop_SetEventsForThisBaseStep
  (boolean_T *eventFlags);

/* Model entry point functions */
extern void Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop_initialize(void);
extern void Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop_step0(void);
extern void Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop_step1(void);
extern void Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop_step2(void);
extern void Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop_terminate(void);

/* Real-time Model object */
extern RT_MODEL_Copy_of_mcb_bldc_sixst *const Copy_of_mcb_bldc_sixstep_f28_M;
extern volatile boolean_T stopRequested;
extern volatile boolean_T runModel;

#ifdef __cpluscplus

extern "C"
{

#endif

  interrupt void ADCINT1(void);
  void Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop_configure_interrupts
    (void);
  void
    Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop_unconfigure_interrupts
    (void);

#ifdef __cpluscplus

}

#endif

/*-
 * The generated code includes comments that allow you to trace directly
 * back to the appropriate location in the model.  The basic format
 * is <system>/block_name, where system is the system number (uniquely
 * assigned by Simulink) and block_name is the name of the block.
 *
 * Use the MATLAB hilite_system command to trace the generated code back
 * to the model.  For example,
 *
 * hilite_system('<S3>')    - opens system 3
 * hilite_system('<S3>/Kp') - opens and selects block Kp which resides in S3
 *
 * Here is the system hierarchy for this model
 *
 * '<Root>' : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop'
 * '<S1>'   : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/ADC_INT1'
 * '<S2>'   : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/ControlButton'
 * '<S3>'   : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control'
 * '<S4>'   : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/SensorCalib'
 * '<S5>'   : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Speed Control'
 * '<S6>'   : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/ToLCD'
 * '<S7>'   : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/ToggleLED'
 * '<S8>'   : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/ADC_INT1/HWI_ADCINT1'
 * '<S9>'   : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/ADC_INT1/HWI_ADCINT1/ECSoC'
 * '<S10>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/ADC_INT1/HWI_ADCINT1/ECSoC/ECSimCodegen'
 * '<S11>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/ControlButton/readDirection'
 * '<S12>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control Signal'
 * '<S13>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System'
 * '<S14>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Data_Logging'
 * '<S15>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Data_Transmit'
 * '<S16>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling'
 * '<S17>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Sensor Driver Blocks'
 * '<S18>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc'
 * '<S19>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation'
 * '<S20>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset'
 * '<S21>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Anti-windup'
 * '<S22>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/D Gain'
 * '<S23>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Filter'
 * '<S24>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S25>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S26>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S27>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S28>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S29>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S30>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S31>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S32>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S33>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S34>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S35>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Saturation'
 * '<S36>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
 * '<S37>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Sum'
 * '<S38>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Sum Fdbk'
 * '<S39>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tracking Mode'
 * '<S40>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum'
 * '<S41>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral'
 * '<S42>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain'
 * '<S43>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/postSat Signal'
 * '<S44>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/preSat Signal'
 * '<S45>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel'
 * '<S46>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone'
 * '<S47>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone/Enabled'
 * '<S48>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/D Gain/Disabled'
 * '<S49>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Filter/Disabled'
 * '<S50>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Filter ICs/Disabled'
 * '<S51>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/I Gain/External Parameters'
 * '<S52>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Ideal P Gain/Passthrough'
 * '<S53>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk/Disabled'
 * '<S54>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Integrator/Discrete'
 * '<S55>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Integrator ICs/External IC'
 * '<S56>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/N Copy/Disabled wSignal Specification'
 * '<S57>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/N Gain/Disabled'
 * '<S58>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/P Copy/Disabled'
 * '<S59>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Parallel P Gain/External Parameters'
 * '<S60>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Reset Signal/External Reset'
 * '<S61>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S62>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S63>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S64>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S65>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S66>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S67>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S68>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S69>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S70>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 * '<S71>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation'
 * '<S72>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/HALL'
 * '<S73>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position'
 * '<S74>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Sector2vector'
 * '<S75>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/SwitchingSequence'
 * '<S76>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant'
 * '<S77>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120'
 * '<S78>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem'
 * '<S79>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem1'
 * '<S80>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem2'
 * '<S81>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem3'
 * '<S82>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem4'
 * '<S83>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem5'
 * '<S84>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem6'
 * '<S85>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Sector2vector/Bit Extract'
 * '<S86>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Sector2vector/Default '
 * '<S87>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Sector2vector/Bit Extract/Extract Bits'
 * '<S88>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/SwitchingSequence/negative'
 * '<S89>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Control_System/Pos_Commutation/Six Step Commutation/SwitchingSequence/positive'
 * '<S90>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Data_Logging/Counter Limited'
 * '<S91>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Data_Logging/Data'
 * '<S92>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Data_Logging/Data_Conditioning'
 * '<S93>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Data_Logging/End'
 * '<S94>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Data_Logging/Start'
 * '<S95>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Data_Logging/Counter Limited/Increment Real World'
 * '<S96>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Data_Logging/Counter Limited/Wrap To Zero'
 * '<S97>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Data_Transmit/CodeGeneration'
 * '<S98>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/Convert ADC value to PU'
 * '<S99>'  : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback'
 * '<S100>' : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/Convert ADC value to PU/LowerSwitchCurrents'
 * '<S101>' : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed'
 * '<S102>' : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/IIR Filter'
 * '<S103>' : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Mechanical to Electrical Position'
 * '<S104>' : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Quadrature Decoder'
 * '<S105>' : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Speed Measurement'
 * '<S106>' : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/IIR Filter/IIR Filter'
 * '<S107>' : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/IIR Filter/IIR Filter/Low-pass'
 * '<S108>' : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S109>' : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Mechanical to Electrical Position/MechToElec'
 * '<S110>' : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Mechanical to Electrical Position/MechToElec/floating-point'
 * '<S111>' : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Mechanical to Electrical Position/MechToElec/floating-point/Compensate Offset'
 * '<S112>' : 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop/Current Control/Input Scaling/QEP Feedback/ Calculate Position and Speed/Mechanical to Electrical Position/MechToElec/floating-point/Mech To Elec'
